/******************************************************/
/* ATMシステムメインプログラム(入力と出力)            */
/******************************************************/

#include "atm.h"
#include <stdio.h>

/* カレントディレクトリ取得*/
// 戻り値：なし
void getGurrentDirectory(char* currentDirectory)
{
	GetCurrentDirectory(CHARBUFF, currentDirectory);
}



/*メインプログラム*/
int main()
{   
    //ファイルポインタ
    FILE* fp;
    errno_t error;

    //ユーザ情報
    USER user;
    //口座残高保存用
    char buf[CHARBUFF] = {0};

    error = fopen_s(&fp, "Results.txt", "w");
    if (error != 0) {
        //ファイルオープンエラー
        fprintf_s(stderr, "failed to open");
        return -1;
    }

	//////////////////////////////////////////////////////////////////////////
	
	//暗証番号入力画面
	printf("****************************************\n");
	printf("*   暗証番号を4桁で入力してください    *\n");
	printf("*   Q:お取引終了                       *\n");
	printf("****************************************\n");
		//暗証番号間違っている
		printf("****************************************\n");
		printf("*   暗証番号が間違っています           *\n");
		printf("*   Enter:次へ                         *\n");
		printf("****************************************\n");

	//残高照会画面
	printf("****************************************\n");
	printf("*   残高照会画面                       *\n");
	printf("*   口座残高はこちらです               *\n");
	printf("*   %28llu 円    *\n", user->Money);
	printf("*   Q:お取引終了                       *\n");
	printf("*   Enter:メイン画面へ                 *\n");
	printf("****************************************\n");

	//預入画面
	printf("****************************************\n");
	printf("*   お預入れ画面                       *\n");
	printf("*   お預入れ金額を入力して下さい       *\n");
	printf("*   Q:お取引終了                       *\n");
	printf("****************************************\n");
		//取引完了画面
		printf("****************************************\n");
		printf("*   お預入れが完了しました             *\n");
		printf("*   Enter:次へ                         *\n");
		printf("****************************************\n");

	//引き出し画面
	printf("****************************************\n");
	printf("*   お引出し画面                       *\n");
	printf("*   お引出し金額を入力して下さい       *\n");
	printf("*   Q:お取引終了                       *\n");
	printf("****************************************\n");
		//残高不足画面
		printf("****************************************\n");
		printf("*   残高不足です                       *\n");
		printf("*   Enter:次へ                         *\n");
		printf("****************************************\n");
		//引き出し画面
		printf("****************************************\n");
		printf("*   お金をお受け取り下さい             *\n");
		printf("*   Enter:次へ                         *\n");
		printf("****************************************\n");
	////////////////////////////////////////////////////////////////////////

	//カレントディレクトリ
	char currentDirectory[CHARBUFF];
	getGurrentDirectory(currentDirectory);

	// iniファイルから読み込み
	
	
	// 暗証番号の読み込み
	
	// 口座残高の読み込み
	
	// 口座残高をiniファイルに書き込み
	

	// 口座残高をresult.txtに書き込み
	
	// ファイルクローズ
	fclose(fp);
	return 0;



}