/******************************************************/
/* ATMシステムメイン画面制御用プログラム              */
/******************************************************/
#include "atm.h"
#include <stdio.h>

// メイン画面表示
// 戻り値：なし
void maintitle()
{
	// 画面表示
	printf("****************************************\n");
	printf("*   いらっしゃいませ 同志社銀行ATMです   *\n");
	printf("*   お取引内容をお選び下さい           *\n");
	printf("*   1:お引出し                         *\n");
	printf("*   2:お預入れ                         *\n");
	printf("*   3:残高照会                         *\n");
	printf("*   Q:お取引終了                       *\n");
	printf("****************************************\n");
}
